# -*- coding: utf-8 -*-

# (определение функций)
import simple_draw

# Написать функцию отрисовки смайлика в произвольной точке экрана
# Форма рожицы-смайлика на ваше усмотрение
# Параметры функции: кордината X, координата Y, цвет.
# Вывести 10 смайликов в произвольных точках экрана.

# TODO здесь ваш код

point = simple_draw.random_point()
simple_draw.circle(point, radius=60, color=simple_draw.random_color())
print(simple_draw.Point.x)


simple_draw.pause()
